# UnavailableDimensionHostReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..UnavailableDimensionHostReference Property
BuiltInFailures..::..DimensionFailures Class See Also
---
A dimension reference could not be resolved on the host element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnavailableDimensionHostReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnavailableDimensionHostReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnavailableDimensionHostReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace